import Layout from '../components/Layout'
import { Container } from 'reactstrap'

const About = () => {
  return (
    <>
      <Layout>
        <Container>
          <h2 className="display-4 text-center py-4">درباره ما</h2>
          <p class="display-5 lead text-right">
              آفرینش فکری فراز با بیش از یک دهه تجربه، با مسئولیت محدود، با
              نمایندگی و مدیر عاملی مجید یاقوتی برای انجام کلیه امور ثبت شرکت، برند
              و علامت تجاری و اختراع در خدمت شما عزیزان است
          </p>
          <p class="text-danger display-4 lead text-right">تخصص ما عینیت بخشیدن به ایده های شماست</p>
          <p class="display-5 lead text-right">امروزه اهمیت استفاده از حقوق مالکیت فکری و ارزش این نوع حقوق بر کسی پوشیده نیست و همه
              اشخاص حقیقی و حقوقی برای حمایت از کسب و کار خود و برای حفظ بازارشان به این مهم پی برده اند. بعضی ها متعاقب تجارب تلخی
              که داشته اند به این نتیجه رسیده اند، اما برخی نیز با هوش مدبرانه خود قبل از هرگونه سوءاستفاده از کسب و کارشان به موقع
              تمام اقدامات لازم را در این زمینه انجام داده اند </p>
        <br />
        <p class="display-5 text-right py-3">ما اینجاییم تا از حقوق و دارایی های معنوی کسب و کار و بازار شما که امروزه از هر چیزی با
          ارزش تر است محافظت کنیم</p>
        </Container>
      </Layout>
    </>
  );
}
 
export default About;